const blogs = [
  {
    id: 1,
    title: "โกลเด้น รีทรีฟเวอร์ (Golden Retriever)",
    image_url:
      "https://cdn.pixabay.com/photo/2012/06/08/02/34/golden-retriever-49519_1280.jpg",
    content:
      "สุนัขขนาดกลาง รักเด็ก ส่วนสูง น้ำหนัก วงจรชีวิต การจัดกลุ่มพันธุ์ 21.5-24 นิ้ว 55-75 ปอนด์ 12-14 ปี สุนัขที่ใช้ในกีฬาล่าสัตว์ ขนชั้นในแน่น และกันน้ำได้ดีเช่นเดียวกัน มีขนปุกปุยหนาแน่นบริเวณคอ ด้านหลังขาหลัง และหาง และมีขนปุกปุยปานกลางบริเวณด้านหลังขาหน้าและท้อง สีของขนมีหลายเฉดสีต่างกันไป ตั้งแต่สีทองเข้มจนถึงทองเงา โกลเดินรีทรีฟเวอร์ เป็นสุนัขที่มีความเฉลียวฉลาดมากมากจนสามารถนำมาฝึกเพื่อใช้งานได้ เนื่องจากเป็นสุนัขที่มีขนาดปานกลาง จัดว่าเป็นสุนัขที่มีประสาทสัมผัสที่ดีทั้งในด้านของการฟังเสียง การดมกลิ่นสะกดรอย นอกจากนี้ยังมีสายตาอันเฉียบคมและแม่นยำ ด้วยเหตุนี้วงการทหารและตำรวจในหลายๆ ประเทศจึงได้นำสุนัขพันธุ์นี้มาฝึกเพื่อไว้ช่วยงานราชการ เช่น ตรวจค้นยาเสพติด, ดมกลิ่นสะกดรอยคนร้าย, ยามรักษาความปลอดภัย แต่ที่ดูเหมือนจะได้รับความนิยมสูงสุด ก็เห็นจะได้แก่ฝึกให้เป็นสุนัขนำทางคนตาบอด ทั้งนี้เพราะโกลเดินรีทรีฟเวอร์เป็นสุนัขซึ่งฉลาด แต่ไม่ค่อยเจ้าเล่ห์หรือซุกซนเหมือนสุนัขบางพันธุ์ ขนชั้นนอกแน่น เงา หยิกเป็นลอนเล็กน้อย และราบเรียบไปตามลำตัว กันน้ำได้ดี",
    
  },
  {
    id: 2,
    title: "เยอรมันเชพเพิร์ด (German Shepherd)",
    image_url:
      "https://cdn.pixabay.com/photo/2014/07/30/18/11/german-shepherd-405503_1280.jpg",
    content:
    "เยอรมันเชพเพิร์ด เป็นสุนัขขนาดใหญ่ ซึ่งขนาดโดยทั่วไปจะอยู่ระหว่าง 55-65 เซนติเมตร (22-26 นิ้ว) วัดจากส่วนที่สูงที่สุดของหลัง และมีน้ำหนักระหว่าง 22-40 กิโลกรัม (49-88 ปอนด์) ความสูงในอุดมคติคือ 63 เซนติเมตร (25 นิ้ว) ตามมาตรฐานของ Kennel Club เยอรมันเชพเพิร์ดจะมีหน้าผากที่เป็นรูปโดม, จมูกและปากส่วนบนเป็นทรงสี่เหลี่ยมยาวและมีจมูกสีดำ ขากรรไกรมีความแข็งแรงร่วมกับฟันที่คมเหมือนกรรไกร มีดวงตาสีน้ำตาลขนาดปานกลางที่ดูกระตือรือร้น, ฉลาดและมั่นใจในตนเอง มีหูขนาดใหญ่และตั้งขึ้นแบบเปิดมาด้านหน้าขนานกัน แต่หูทั้งสองข้างมักจะลู่ไปด้านหลังเมื่อมีการเคลื่อนไหว เยอรมันเชพเพิร์ดมีคอที่ยาว ซึ่งจะยืดขึ้นเมื่อมีอาการตื่นเต้นและจะหดลงเมื่อเคลื่อนที่ด้วยความเร็วสูง หางมีลักษณะเป็นพุ่มและยาวไปจนถึงข้อเท้า สีขนของเยอรมันเชพเพิร์ดมีหลายแบบ โดยสีที่มักพบเห็นได้บ่อยคือสีแทนดำ และสีแดงดำ โดยสีที่แตกต่างกันทั้งสองแบบนั้นจะมีสีดำปกคลุมอยู่บนใบหน้าและลำตัว ส่วนสีขนที่หายากประกอบไปด้วย สีน้ำตาลเข้ม, สีดำล้วน, สีขาวล้วน, สีเงินและสีน้ำเงิน สายพันธุ์ที่มีสีดำล้วนและสีน้ำตาลเข้มเป็นที่ยอมรับตามมาตรฐานส่วนใหญ่ อย่างไรก็ตามสีน้ำเงินและสีเงินถือว่าเป็นข้อบกพร่องและสีขาวล้วนถือว่าไม่มีคุณสมบัติที่เหมาะสมในบางมาตรฐาน เนื่องจากขนสีขาวทำให้ถูกมองเห็นได้ง่าย ทำให้ไม่เหมาะที่จะนำมาเป็นสุนัขเฝ้ายามและเป็นการยากที่จะถูกมองเห็นในบางสถานการณ์ อย่างเช่นในกรณีที่มีหิมะหรือเมื่อทำการต้อนแกะ เยอรมันเชพเพิร์ดมีขนสองชั้น ขนชั้นนอกซึ่งร่วงตลอดทั้งปีและมีขนชั้นในที่แน่นหนา โดยลักษณะขนที่เป็นที่ยอมรับมีสองแบบคือ ขนยาวปานกลางและขนยาว โดยขนยาวเป็นยีนด้อยทำให้ขนยาวเป็นลักษณะที่พบได้น้อย",
    
  },
  {
    id: 3,
    title: "ชิวาวา (Chihuahua)",
    image_url:
      "https://cdn.pixabay.com/photo/2019/05/29/20/29/dog-4238480_1280.jpg",
    content:
    "โดยทั่วไปแล้วความสูงของชิวาวาไม่ได้ถูกกำหนดเอาไว้ มีเพียงน้ำหนักและคำอธิบายสัดส่วนโดยรวมของพวกมันที่ถูกระบุไว้ ส่งผลทำให้พวกมันมีความสูงที่แตกต่างกันมากกว่าสายพันธุ์อื่น ๆ โดยทั่วไปแล้วชิวาวาจะมีความสูงอยู่ระหว่าง 6-10 นิ้ว แต่อย่างไรก็ตามชิวาวาบางตัวสามารถสูงได้ถึง 12-15 นิ้ว (30 ถึง 38 ซม.) จากมาตรฐานสายพันธุ์ของทั้งอังกฤษและอเมริกาได้ระบุไว้ว่าชิวาวาต้องหนักไม่เกิน 6 ปอนด์เพื่อความสอดคล้องกัน อย่างไรก็ตามมาตรฐานของอังกฤษระบุว่าชิวาวาควรมีน้ำหนัก 2-4 ปอนด์และถ้าหากสุนัขทั้งสองตัวดีพอ ๆ กันควรเลือกตัวที่มีขนาดเล็กกว่า ชิวาวา เป็นหมาที่มีความฉลาดหลักแหลม อีกทั้งยังคงมีความจงรักภักดีต่อผู้เลี้ยงเป็นอย่างมาก มีอัธยาศัยดี บางครั้ง ชิวาวา ก็ดูเงียบสงบและไม่ค่อยส่งเสียงเสียเท่าไหร่นัก แต่ถ้าหากถูกรบกวนเมื่อไหร่ หรือแม้กระทั่งมีอาการตกใจ ชิวาวา ก็จะส่งเสียงเห่าเพื่อรักษาอาณาเขตของตนเอง และด้วยลักษณะนิสัยแบบนี้ ชิวาวา จึงถือได้ว่าเป็นสุนัขที่มีนิสัยกล้าหาญ และรักที่จะต่อสู้",

  },
  {
    id: 4,
    title: "ปอมเมอเรเนียน (Pomeranian)",
    image_url:
      "https://cdn.pixabay.com/photo/2018/08/20/14/08/dog-3619020_1280.jpg",
    content:
      "ปอมเมอเรเนียนเป็นสุนัขขนาดเล็กที่มีน้ำหนัก 1.9-3.5 กิโลกรัม (4.2-7.7 ปอนด์) และสูง 5.0-11 นิ้ว (13-28 ซม.) โดยวัดจากส่วนสูงที่สุดของหลัง ปอมเป็นสุนัขที่มีขนาดกะทัดรัดแต่มีความแข็งแรง ขนแน่นหนา มีขนเป็นพุ่มอยู่บริเวณรอบ ๆ คอและหลัง โคนหางตั้งสูงและแนบไปกับหลัง ตัวอย่างของการผสมพันธุ์ในรุ่นแรก ๆ ปอมมีขนเป็นสีขาวหรือบางครั้งเป็นสีดำ โดยในปี 1888 ราชินีวิกตอเรียนำปอมเมอเรเนียนสีแดงขนาดเล็กมาเลี้ยงจึงทำให้สีแดงกลายเป็นที่นิยมในปลายของศตวรรษที่ 19 โดยในยุคปัจจุบันปอมเมอเรเนียนมีสีขนที่หลากหลายมากกว่าสุนัขสายพันธุ์อื่น ๆ ได้แก่ สีขาว, สีดำ, สีน้ำตาล, สีแดง, สีส้ม, สีครีม, สีน้ำเงิน, สีน้ำตาลเข้ม, สีน้ำตาลผสมสีแทน, สีดำผสมสีแทน และสีที่แซมกันสองสี โดยสีที่พบได้บ่อยมากที่สุดคือสีส้ม, สีดำ และสีครีม/สีขาว ปอมเมอเรเนียนลายหินอ่อน (merle) เป็นสีที่ผู้เพาะพันธุ์ได้พัฒนาขึ้นมาล่าสุด เป็นการรวมกันของสีพื้นที่เป็นสีอ่อน เช่น สีน้ำเงิน, สีเทา แต้มด้วยรอยด่าง โดยแต้มสีที่พบบ่อยที่สุด คือสีแดง, สีน้ำตาล หรือสีดำ ส่วนสีที่ไม่เป็นที่ยอมรับภายใต้มาตรฐานสายพันธุ์ เช่น ลายเสือหินอ่อน (brindle merle) หรือ สีน้ำตาลเข้มลายหินอ่อน (liver merle) ลายหินอ่อนในปอมเมอเรเนียนจะมีสีของตา, จมูกและอุ้งเท้าที่มีความแตกต่างกัน โดยส่วนของตาจะมีสีฟ้า ส่วนจมูกและอุ้งเท้าจะเป็นรอยด่างสีชมพูและสีดำ ปอมเมอเรเนียนมีขน 2 ชั้นที่หนาซึ่งทำความสะอาดได้ไม่ยาก เนื่องจากความหนาของขนและมีการผลัดขนอยู่เป็นประจำจึงแนะนำให้ทำความสะอาดทุกวัน โดยขนชั้นนอกมีลักษณะยาวตรงและหยาบ ในขณะที่ขนชั้นในนิ่มหนาและสั้น ขนของปอมมักเป็นกระจุกและพันกันได้ง่ายโดยเฉพาะอย่างยิ่งเมื่อมีการผลัดขนชั้นในซึ่งจะเกิดขึ้นปีละสองครั้ง",    
  },
  {
    id: 5,
    title: "ไซบีเรียนฮัสกี (Siberian Husky)",
    image_url:
      "https://cdn.pixabay.com/photo/2016/10/26/14/47/siberian-husky-1771667_1280.jpg",
    content:
    "ไซบีเรียน ฮัสกี้ มีลักษณะภายนอกคล้ายกับ อลาสกัน มาลามิ้ว (Alaskan Malamute) และสุนัขสายพันธุ์อื่น ๆ ที่พัฒนามาจากสุนัขวงศ์สปิตซ์ (Spitz) เช่น ซามอย เมื่อเปรียบเทียบกับสุนัขสายพันธุ์อื่น ไซบีเรียน ฮัสกี้ นับว่ามีลักษณะเด่นที่แตกต่าง นั่นคือมีสีและลักษณะขนที่หลากหลาย ส่วนมากมักมีขนสีขาวที่เท้า ขา หน้า(มีลักษณะคล้ายหน้ากาก) และปลายหาง โดยลักษณะทั่วไปของสุนัขพันธุ์นี้คือ มีสีดำ-ขาว,ทองแดง-ขาว, เทา-ขาว และสีขาวล้วน ร่วมกับลักษณะเฉพาะอื่น ๆ เช่น มีจุดสีบรอนซ์ หรือบรอนซ์อ่อน ๆ หรือมีลักษณะอื่น ๆที่คล้ายกับหมาป่า The American Kennel Club ได้อธิบายลักษณะดวงตาของไซบีเรียน ฮัสกี้ ไว้ว่ามีรูปร่างคล้ายเมล็ดอัลมอนด์ ตั้งเอียงเล็กน้อย มีระยะห่างกันปานกลาง สีดวงตาที่พบส่วนใหญ่คือ สีฟ้าน้ำแข็ง (Ice-Blue), น้ำเงินเข้ม(Dark Blue), สีเหลืองอำพัน(Amber) และสีน้ำตาล(Brown) และในบางตัวอาจพบได้ว่ามีสีตาที่ต่างกันในแต่ละข้าง เช่น ข้างหนึ่งมีตาสีฟ้า และอีกข้างมีสีน้ำตาล (Complete Heterochromia) หรือในหนึ่งข้างมีทั้งสองสีอย่าง สีน้ำตาล และสีฟ้าแบ่งส่วนกัน (Partial Heterochromia)",
    
  },
  {
    id: 6,
    title: "ซามอยด์ (Samoyed)",
    image_url:
      "https://cdn.pixabay.com/photo/2017/09/19/15/07/samoyed-2765557_1280.jpg",
    content:
    "สุนัขพันธุ์ซามอยด์เป็นสุนัขขนาดกลาง มีลักษณะที่จำเพาะคือมีขนสีขาวร่วมกับใบหน้าที่มีแต่รอยยิ้ม (Samoyed smil) จึงเป็นที่นิยมเลี้ยงในปัจจุบัน ลักษณะทั่วไป หัวมีขนาดสมส่วนกับร่างกาย หูยกตั้งเป็นทรงสามเหลี่ยม บริเวณปลายหูกลม ดวงตากลมสดใส มีจมูกสีดำ มีฟันที่คมเหมือนกรรไกร ขนสีขาวหนาสวยเป็นประกายโดดเด่น สุนัขเพศผู้มีลักษณะส่วนสูงวัดจากพื้นถึงหัวไหล่ 21-25 นิ้ว (ประมาณ 53-63 เซนติเมตร) และมีน้ำหนักอยู่ที่ 45-65 ปอนด์ (ประมาณ 20-30 กิโลกรัม) และสุนัขเพศเมียมีลักษณะส่วนสูงวัดจากพื้นถึงหัวไหล่ 19-21 นิ้ว (ประมาณ 45-53 เซนติเมตร) และมีน้ำหนักอยู่ที่ 35-50 ปอนด์ (ประมาณ 15-23 กิโลกรัม)",
    
  },
  {
    id: 7,
    title: "บีเกิล (Beagle)",
    image_url:
      "https://cdn.pixabay.com/photo/2017/10/12/20/21/dog-2845798_1280.jpg",
    content:
    "สุนัขบีเกิลถูกจัดอยู่ในกลุ่ม สุนัขขนาดกลาง อยู่ในกลุ่มต้น ๆ ของสุนัขล่าสัตว์ ด้วยโครงสร้างที่สมส่วน กล้ามเนื้อที่แข็งแรง และมีขนาดกระทัดรัด จุดเด่นแรกของพวกมันต้องเป็นเรื่องหูที่จะดูพับลงมา หูค่อนข้างกว้างและกลม และมีขนาดที่ใหญ่ ดวงตากลมใหญ่ ตั้งอยู่ในตำแหน่งพอดี มีหางที่เรียวยาว ปลายหางโค้งขึ้นเล็กน้อย กะโหลกค่อนข้างยาว ท้ายทอยเป็นรูปโดม หน้าผากกว้าง สุนัขบีเกิลเป็นสุนัขที่มีขนสั้นเรียบลำตัวมีความยาวของลำตัวมากกว่าด้านสูงเล็กน้อย หูชิดกับหัว โดยทั่วไปสีของบีเกิ้ลมี 3 สี ได้แก่ สีขาว สีดำและสีน้ำตาลไหม้ แต่สีที่เด่นและเป็นที่ยอมรับ คือต้องมีสีครบทุกสีบนตัวจะเป็นที่ยอมรับ สุนัขบีเกิลขนาดมาตรฐานเมื่อโตเต็มที่จะมีน้ำหนักเฉลี่ยอยู่ที่ 15 ปอนด์ (6.8 กิโลกรัม) ถึง 30 ปอนด์ (13.6 กิโลกรัม) เพศผู้มีความสูงอยู่ระหว่าง 33 ถึง 38 เซนติเมตร (13-15 นิ้ว) โดยวัดจากส่วนที่สูงที่สุดของหลังและตัวเมียจะตัวเล็กกว่าเล็กน้อย",
    
  },
  {
    id: 8,
    title: "โดเบอร์แมน พินสเชอร์ (Doberman Pinscher)",
    image_url:
      "https://cdn.pixabay.com/photo/2016/03/27/18/12/luna-1283356_1280.jpg",
    content:
    "โดเบอร์แมน พินสเชอร์ เป็นสุนัขขนาดกลาง วัดความสูงจากพื้นไปจนถึงไหล่สำหรับตัวโตเต็มวัยได้ 26-28 นิ้ว ซึ่งอาจแตกต่างกันในตัวผู้และตัวเมีย โดยตัวเมียนั้นอาจตัวเล็กกว่าตัวผู้ 2-4 นิ้ว ตัวผู้มีน้ำหนักประมาณ 75-100 ปอนด์ (35-45 กิโลกรัม) และตัวเมียมีน้ำหนักประมาณ 60-90 ปอนด์ (27-41 กิโลกรัม)  มีศีรษะที่ยาวเรียวและมีลำตัวเพรียว มีจุดเด่นที่กล้ามเนื้อทำให้มีความปราดเปรียวอย่างมาก ซึ่งเป็นลักษณะพิเศษในสุนัขประเภทสุนัขใช้งาน (Working dog) โดเบอร์แมนนั้นมีขนลักษณะนุ่ม เรียบ สั้น มันวาว เรียงเป็นระเบียบ มีอยู่หลายสี เช่น สีดำ สีแดง และสีน้ำตาลอมเหลือง โดยทางสมาคมอเมริกัน เคนเน็ล คลับ (America Kennel Club, AKC) ได้กำหนดว่าสายพันธุ์โดเบอร์แมนที่ได้รับการขึ้นทะเบียนต้องมีได้แค่ 3 สี และมีรอยแต้มสีสนิมได้ที่เหนือดวงตา บนจมูกและปาก ลำคอ และหน้าอกส่วนหน้า ด้านล่างหาง หรืออาจมีรอยปื้นสีขาวกลางหน้าอกได้ แต่ขนาดต้องไม่เกิน ½ ตารางนิ้ว ส่วนหางของโดเบอร์แมนนั้นตั้งแต่เกิดจะมีหางเป็นลักษณะยาว และเรียว ในประเทศสหรัฐอเมริกามักทำการตัดหางตั้งแต่ยังเล็ก ส่วนหูของโดเบอร์แมนจะมีลักษณะห้อยลงตั้งแต่เกิดแต่ไม่เป็นที่นิยม นักเพาะพันธุ์สุนัขจึงนิยมตัดตกแต่งใบหู และดัดให้ตั้งขึ้น โดยมักจะทำในอายุระหว่าง 7-9 สัปดาห์ หากทำเมื่ออายุมากกว่า 12 สัปดาห์โอกาศที่หูจะตั้งจะลดน้อยลง นอกจากนี้ โดเบอร์แมนเป็นสุนัขที่ไม่ค่อยมีกลิ่นตัว ทำให้ง่ายต่อการดูแล และทำความสะอาด",
    
  },
  {
    id: 9,
    title: "ชิบะอินุ (Shiba Inu)",
    image_url:
      "https://cdn.pixabay.com/photo/2021/12/04/20/59/animal-6845972_1280.jpg",
    content:
    "ชิบะเป็นสุนัขรูปร่างกะทัดรัด มีกล้ามเนื้อที่ได้รับการพัฒนามาอย่างดี โดยเพศผู้และเพศเมียมีลักษณะที่แตกต่างกันอย่างชัดเจน เพศผู้สูงประมาณ 14 นิ้วครึ่งถึง 16 นิ้วครึ่ง (35-43 ซม.) โดยวัดจากส่วนที่สูงที่สุดของหลัง เพศเมียสูงประมาณ 13 นิ้วครึ่งถึง 15 นิ้วครึ่ง (33-41 ซม.) ขนาดที่เป็นที่ต้องการ คือ ค่ากลางของแต่ละเพศ น้ำหนักเฉลี่ยของขนาดที่ต้องการอยู่ที่ประมาณ 23 ปอนด์ (10 กิโลกรัม) สำหรับเพศผู้และ 17 ปอนด์ (8 กิโลกรัม) สำหรับเพศเมีย ชิบะมีขน 2 ชั้น โดยขนชั้นนอกมีลักษณะแข็งและตรง ส่วนขนชั้นในจะนุ่มและหนา มีขนสั้นแม้กระทั้งบนใบหน้า, หู, และขา ขนชั้นนอกที่ยื่นออกจากร่างกายมีความยาวประมาณ 1 นิ้วครึ่งถึง 2 นิ้วโดยวัดความยาวจากส่วนที่สูงที่สุดของหลัง ขนหางยาวเล็กน้อยและตั้งขึ้นม้วนเป็นพุ่ม ชิบะอาจจะมีสีขนเป็นสีแดง, สีดำและสีแทนหรือสีงาแดง (ตรงโคนจะเป็นสีแดงส่วนปลายขนจะเป็นสีดำ) และขนชั้นในที่มีสีครีม, สีน้ำตาลอมเหลืองหรือสีเทา ชิบะอินุอาจจะมีขนสีครีมซึ่งเป็นข้อด้อยหลักและไม่ควรนำไปขยายพันธุ์ เนื่องจากลายที่ต้องการซึ่งเรียกว่า “urajiro” (裏白) นั้นจะไม่ปรากฏให้เห็น “Urajiro” แปลว่า “สีขาวด้านล่าง” โดย urajiro (สีขาวจนถึงสีครีม) ต้องมีอยู่ในพื้นที่เหล่านี้ทั้งหมดคือที่ด้านข้างของบริเวณรอบปาก, บนแก้ม, ด้านในหู, ใต้คาง, ข้างใต้คอบริเวณด้านในของขา, บนท้องและด้านในของหาง ปกติจะพบสีแดงได้ที่คอ, ที่อกด้านหน้าและหน้าอก ส่วนสีดำและสีงาโดยทั่วไปจะพบเป็นสัญลักษณ์รูปสามเหลี่ยมทั้งสองด้านของอกด้านหน้า",
    
  },
  {
    id: 10,
    title: "ปั๊ก (Pug)",
    image_url:
      "https://cdn.pixabay.com/photo/2017/02/03/17/34/pug-2035675_1280.jpg",
    content:
    "สุนัขพันธุ์นี้มักถูกเรียกเป็น multum in parvo หรือ น้อยแต่มาก ซึ่งได้มาจากลักษณะนิสัยของสุนัขพันธุ์นี้ ที่ชอบทำอะไรตรงข้ามกับขนาดตัวที่เล็ก สุนัขพันธุ์นี้ปรากฏขึ้นในสมัยศตวรรษที่ 18 โดยมีลักษณะตัวยาวและผอมเพรียว สุนัขที่ได้รับความนิยมในสมัยนั้นมีลำตัวทรงสี่เหลี่ยม ปราดเปรียว ตัวแน่น หน้าอกลึกและมีกล้ามเนื้อจำนวนมาก สุนัขพันธุ์ปั๊กมีรูปทรงของหูที่แตกต่างกัน 2 รูปทรง คือ กุหลาบ และรูปร่างกลม หูทรงกุหลาบมักมีขนาดเล็กกว่าขนาดมาตรฐานที่เป็นทรงกลมและมีส่วนด้านหน้าที่โค้งงอมาทางด้านข้างของหัว แต่ลักษณะที่มากับพันธุ์เลยคือรูปร่างทรงกลม ขาของสุนัขพันธุ์นี้มีความแข็งแรงมาก เหยียดตรง ยาวปานกลางและสามารถใช้งานได้คล่องแคล่ว ส่วนหัวไหล่ลู่ไปทางด้านหลังเล็กน้อย ส่วนของข้อเท้ามีความแข็งแรงไม่ว่าจะเป็นการก้าวและการลงน้ำหนัก ฝาเท้าไม่ยาวมากเหมือนฝาเท้ากระต่ายและไม่กลมมากเหมือนเท้าแมว นิ้วเท้าแยกออกจากกันและมีเล็บสีดำ ฟันล่างงอกเป็นปกติมากกว่าฟันบนทำให้มีลักษณะการสบฟันแบบ under-bite",
    
  },

];

export default blogs;